#Літерали – об’єкти певного типу даних
#Ви використовуєте літерали для кодування даних і розміщення їх у своєму коді. 

#число можна записати або так: 11111111, або так: 11_111_111.

# print(0o123)
#0o123 – вісімкове число з відповідним десятковим значенням 83.

# print(0x123)
#0x123 - шістнадцяткове число з відповідним десятковим значенням 291.

#4 є цілим числом, тоді як 4.0 ‒ число з рухомою крапкою.

#print("Мені подобається \"Монті Пайтон\"") символ екранування

# print('I\'m Monty Python.')
# print("I'm Monty Python.")

# print(True > False)   True
# print(True < False)   False

#print('"я"\n""вивчаю""\n"""Python"""')

# "1.5", 2.0, 528, False
# Перший – рядок, другий – числовий літерал (float), третій – числовий літерал (integer), четвертий – булевий літерал.