# print("Скажи мені що-небудь...")
# anything = input()
# print("Хм...", anything, "... Дійсно?")


# anything = input("Скажи мені що-небудь...")
# print("Хм...", anything, "...справді?")

# функція input() викликається з одним аргументом ‒ це рядок, що містить повідомлення;
# повідомлення буде виведено на консоль до того, як користувачу буде надана можливість ввести будь-що;
# після чого функція input() виконає свою задачу.
# Такий варіант виклику input() спрощує код та робить його більш зрозумілим.

# anything = input("Введіть число: ")
# something = anything ** 2.0  ---  ви не можете використовувати його як аргумент будь-якої арифметичної операції, 
# print(anything, "в степені 2 дорівнює", something)
# Ми вже говорили про це, але треба ще раз підкреслити ‒ результатом функції input() є рядок.


# функція int() отримує один аргумент (наприклад, рядок: int(string)) і намагається перетворити його в ціле число; якщо їй це не вдається, то вся програма завершиться помилкою (для цієї ситуації є обхідний шлях, але про нього ми поговоримо пізніше);
# функція float() отримує один аргумент (наприклад, рядок: float(string)) і намагається перетворити його у число з рухомою крапкою (решта ‒ те саме).


# anything = float(input("Введіть число: "))
# something = anything ** 2.0
# print(anything, "в степені 2 дорівнює", something)


# leg_a = float(input("Введіть довжину першого катета: "))
# leg_b = float(input("Введіть довжину другого катета: "))
# hypo = (leg_a**2 + leg_b**2) ** .5
# print("Довжина гіпотенузи дорівнює", hypo)


# print("+" + 10 * "-" + "+")
# print(("|" + " " * 10 + "|\n") * 5, end="")
# print("+" + 10 * "-" + "+")

# a = float(input("введіть тут значення з рухомою крапкою для змінної a: "))
# b = float(input("введіть тут значення з рухомою крапкою для змінної b: "))

# print("Результат додавання: " + str(a+b))
# print("Результат віднімання: " + str(a-b))
# print("Результат множення: " + str(a*b))
# print("Результат ділення: " + str(a/b))

# print("\nУсе, друзі!")


# x = float(input("Введіть тут значення x: "))
# y = 1 / (x + 1 / (x + 1 / (x + 1 / x)))
# print("y= ", y)


# hour = int(input("Час початку (години): "))
# mins = int(input("Час початку (хвилини): "))
# dura = int(input("Тривалість події (хвилин): "))
# mins = mins + dura # знаходимо суму всіх хвилин
# hour = hour + mins // 60 # знаходимо кількість годин, прихованих у хвилинах, та оновлюємо час
# mins = mins % 60 # коригуємо хвилини, щоб вони потрапляли в діапазон (0..59)
# hour = hour % 24 # коригуємо години, щоб вони потрапляли в діапазон (0..23)
# print(hour, ":", mins, sep='')


# name = input("Введіть своє ім'я: ")
# print("Привіт, " + name + ". приємно познайомитись!")
 
# print("\nНатисніть Enter, щоб завершити програму.")
# input()
# print("КІНЕЦЬ.")

# print(1 // 2 )

# x = 1
# y = 2
# z = x
# x = y
# y = z
# print(x, y)

# x = input()
# y = input()
# print(x + y)
 

# x = int(input())
# y = int(input())
 
# x = x // y
# y = y // x
 
# print(y)


# x = int(input())
# y = int(input())
 
# x = x / y
# y = y / x
 
# print(y)


# x = int(input())
# y = int(input())
 
# x = x % y
# x = x % y
# y = y % x
 
# print(y % x)
 
# y = 2 + 3 * 5.
# print(Y)

# x = 1 / 2 + 3 // 3 + 4 ** 2
# print(x)


# x = int(input())
# y = int(input())
 
# print(x + y)
 

x = input()
y = int(input())
 
print(x * y)